Repository: buepro/typo3-timelog
Catalog: Resources/Private/Language/*.locallang.xlf
Languages: de, fi

# tx_timelog_domain_model_task
source: Task
de: Aufgabe
fi: Tehtävä

# tx_timelog_domain_model_task.batch_date
source: Batch Date
de: Stapeldatum
fi: Erän päivämäärä

# tx_timelog_domain_model_task.worker
source: Worker
de: Arbeiter
fi: Tekijä

# tx_timelog_domain_model_task.intervals
source: Intervals
de: Intervalle
fi: Aikaväli

# tx_timelog_domain_model_interval
source: Interval
de: Intervall
fi: Aikaväli

# tx_timelog_domain_model_interval.start_time
source: Start Time
de: Startzeit
fi: Alkamisaika

# tx_timelog_domain_model_interval.end_time
source: End Time
de: Endzeit
fi: Päättymisaika

# tx_timelog_domain_model_interval.duration
source: Duration
de: Dauer
fi: Kesto

# tx_timelog_domain_model_project.client
source: Client
de: Kunde
fi: Asiakas

# tx_timelog_domain_model_project.owner
source: Owner
de: Inhaber
fi: Omistaja

source: Handle
de: Referenz
fi: Kahva

source: Title
de: Titel
fi: Titteli

source: Description
de: Beschreibung
fi: Kuvaus

source: Project
de: Projekt
fi: Projekti

source: Active time
de: Aktive Zeit
fi: Aktiivinen aika

source: Heap time
de: Gehäufte Zeit
fi: Lajittelematon aika

source: Batch time
de: Gestapelte Zeit
fi: Erän nimi

source: Batch
de: Stapel
fi: Erän

source: Task group
de: Aufgabengruppe
fi: Tehtäväryhmä

source: Project handle
de: Projektreferenz
fi: Projektin kahva

source: Task group handle
de: Referenz Aufgabengruppe
fi: Tehtäväryhmän kahva

source: Batch handle
de: Stapelreferenz
fi: Eräkahva

source: Task handle
de: Arbeitsreferenz
fi: Tehtäväkahva

# hourAbbreviation
source: h
fi: t

source: Date
de: Datum
fi: Pvm

# sendMailTo
source: Send email to %s
de: E-Mail an %s versenden
fi: Lähetä sähköpostia osoitteeseen %s

# mailSubject
source: Project progress - %s
de: Projektfortschritt - %s
fi: Projektin eteneminen - %s

# salutationNeutral
source: Dear client
de: Guten Tag
fi: Hyvä asiakas

# salutationPersonal
source: Dear Miss/Mr. %s
de: Guten Tag Frau/Herr %s
fi: Rakas neiti / herra %s

# projectProgressText
source: Your project %s is progressing. Currently there are %.1f hours registered in our time recording (%.1f heap houres). The following work has been done recently:
de: Ihr Projekt %s schreitet voran. Aktuell sind %.1f Stunden in unserer Zeiterfassung registriert (%.1f ungeordnet). Folgende Arbeiten wurden kürzlich durchgeführt:
fi: Projekti %s etenee. Tällä hetkellä aikatietoihimme on rekisteröity %.1f tuntia (%.1f kasan hourea). Seuraava työ on tehty viime aikoina:

# greeting
source: Best regards
de: Freundliche Grüsse
fi: Parhain terveisin

# aboutTimelog
source: This report has been created by %s with the extension %s from %s.
de: Dieser Bericht wurde mit %s und der Erweiterung %s von %s erstellt.
fi: Tämän raportin on luonut %s laajentamisen kanssa %s alkaen %s.

source: Actions
de: Aktionen
fi: Toiminnot

source: Batched tasks
de: Gestapelte Arbeiten
fi: Erätehtävät

source: Heaped tasks
de: Gehäufte Arbeiten
fi: Kasaan tehtäviä

# heapProjectListTitle
source: Heaped tasks from project %s
de: Angehäufte Aufgaben des Projektes %s
fi: Kasa tehtäviä projektin %s

# heapGroupListTitle
source: Heaped tasks from group %s
de: Angehäufte Aufgaben der Gruppe %s
fi: Ryhmän %s kasatut tehtävät

# batchProjectListTitle
source: Batched tasks (%s) from project %s
de: Gestapelte Aufgaben (%s) des Projektes %s
fi: Erätehtävät (%s) projektista %s

# batchGroupListTitle
source: Batched tasks (%s) from group %s
de: Gestapelte Aufgaben (%s) der Gruppe %s
fi: Erätehtävät (%s) ryhmästä %s

source: Send email to client
de: Email an Kunde senden
fi: Lähetä sähköpostia osoitteeseen

source: Create batch
de: Arbeitsstapel erstellen
fi: Luo erä

source: Tasks
de: Arbeiten
fi: Tehtävät

source: Find tasks
de: Arbeiten finden
fi: Etsi tehtäviä

source: Find
de: Finden
fi: Etsi

# noTasksFound
source: No tasks were found for the given criteria.
de: Für die gegebenen Kriterien konnten keine Arbeiten gefunden werden.
fi: Annetuille kriteereille ei löytynyt tehtäviä.

source: Projects
de: Projekte
fi: Projektit

# projectListInfo
source: The following list shows all projects having hashed tasks.
de: Die folgende Liste enthält alle Projekte, welche noch gehäufte Arbeiten enthalten.
fi: Seuraava luettelo näyttää kaikki projektit, joilla on suoritettu tehtäviä.

# noProjectsFound
source: No projects were found for the given criteria.
de: Für die gegebenen Kriterien konnten keine Projekte gefunden werden.
fi: Hankkeita ei löytynyt annettujen kriteerien perusteella.

source: Include all
de: Alle einbeziehen
fi: Sisällytä kaikki

source: Exclude all
de: Alle ausschließen
fi: Sulje pois kaikki
